bookstore_app/app/views/novels/new.html.erb

	<%= f.label :genre %><br />
	<%= f.select :genre_id, Genre.all.collect {|x| [x.name, x.id]}, {:include_blank =>'Select genre'}, class:'form-control' %><br />
---
SELECT `genres`.* FROM `genres`

	<%= f.label :publisher %><br />
	<%= f.select :publisher_id, Publisher.all.collect {|x| [x.name, x.id]}, {:include_blank =>'Select publisher'}, class:'form-control' %><br />
---
SELECT `publishers`.* FROM `publishers`

	<%= f.label :author %><br />
	<%= f.select :author_id, Author.all.collect {|x| [x.fname + ' ' + x.lname, x.id]}, {:include_blank =>'Select author'}, class:'form-control' %><br />
---
SELECT `authors`.* FROM `authors`