bookstore_app/app/controllers/authors_controller.rb

  def index
    @author=Author.all
---
SELECT `authors`.* FROM `authors`

  def show
    @author=Author.find(params[:id])
---
SELECT  `authors`.* FROM `authors` WHERE `authors`.`id` = 1 LIMIT 1

  def create
    @author = Author.new(author_params)
    if @author.save
---
INSERT INTO `authors` (`fname`, `lname`, `bio`, `created_at`, `updated_at`) VALUES ('Jamie', 'MAcleod', 'I am an author of bookgs', '2019-02-04 11:01:23', '2019-02-04 11:01:23')

  def search
    @author = if params[:term]
      Author.where('lname LIKE ?', "%#{params[:term]}")
    else
      Author.all
---
SELECT `authors`.* FROM `authors` WHERE (lname LIKE '%Thing' OR country LIKE '%Thing')
SELECT `authors`.* FROM `authors`