bookstore_app/app/controllers/books_controller.rb

	def create
		#render plain: params[:book] .inspect
		@book=Book.new(book_params)
		@book.save
---
INSERT INTO `books` (`title`, `price`, `book_id`, `publisher`, `description`, `number`, `created_at`, `updated_at`) VALUES ('Harry Potter', 7.0, 'Harry Potter', 'Bloomberg', 'Wizard boy', 6.0, '2019-02-01 13:00:09', '2019-02-01 13:00:09')