bookstore_app/app/controllers/genres_controller.rb

  def index
    @genre=Genre.all
---
SELECT `genres`.* FROM `genres`

  def show
    @genre=Genre.find(params[:id])
---
SELECT  `genres`.* FROM `genres` WHERE `genres`.`id` = 1 LIMIT 1

  def create
    @genre = Genre.new(genre_params)
    if @genre.save
---
INSERT INTO `genres` (`name`, `created_at`, `updated_at`) VALUES ('Fantasy', '2019-02-04 11:35:54', '2019-02-04 11:35:54')