bookstore_app/app/controllers/novels_controller.rb

SELECT `novels`.* FROM `novels`
---
  def index
    @novel=Novel.all

SELECT  `novels`.* FROM `novels` WHERE `novels`.`id` = 2 LIMIT 1
---
  def show
    @novel=Novel.find(params[:id])

INSERT INTO `novels` (`title`, `genre_id`, `author_id`, `publisher_id`, `isbn`, `price`, `format`, `description`, `pages`, `created_at`, `updated_at`) VALUES ('Jane Eyre', 1, 2, 1, '654366', 12.0, 'Book', 'It is xmas book.', 121212, '2019-02-08 13:18:21', '2019-02-08 13:18:21')
---
  def create
    @novel = Novel.new(novel_params)
    if @novel.save

SELECT  `novels`.* FROM `novels` WHERE `novels`.`id` = 2 LIMIT 1
UPDATE `novels` SET `title` = 'Scrooge THIS IS AN EDIT', `updated_at` = '2019-02-04 14:49:29' WHERE `novels`.`id` = 2
---
  def update
    @novel = Novel.find(params[:id])
    if @novel.update(novel_params)

SELECT  `novels`.* FROM `novels` WHERE `novels`.`id` = 2 LIMIT 1
---
  def edit
    @novel = Novel.find(params[:id])

SELECT  `novels`.* FROM `novels` WHERE `novels`.`id` = 1 LIMIT 1
DELETE FROM `novels` WHERE `novels`.`id` = 1
---
  def destroy
    @novel = Novel.find(params[:id])
    @novel.destroy

SELECT `novels`.* FROM `novels` WHERE (title LIKE '%Scrooge')
SELECT `novels`.* FROM `novels`
---
  def search
    @novel = if params[:term]
      Novel.where('title LIKE ? OR format LIKE ?', "%#{params[:term]}", "%#{params[:term]}")
    else
      Novel.all