bookstore_app/app/controllers/publishers_controller.rb

  def index
    @publisher=Publisher.all
---
SELECT `publishers`.* FROM `publishers`

  def show
    @publisher=Publisher.find(params[:id])
---
SELECT  `publishers`.* FROM `publishers` WHERE `publishers`.`id` = 1 LIMIT 1

  def create
    @publisher = Publisher.new(publisher_params)
    if @publisher.save
---
INSERT INTO `publishers` (`name`, `country`, `created_at`, `updated_at`) VALUES ('Jamie', 'England', '2019-02-04 11:54:17', '2019-02-04 11:54:17')

  def search
    @publisher = if params[:term]
      Publisher.where('country LIKE ?', "%#{params[:term]}")
    else
      Publisher.all
---
SELECT `publishers`.* FROM `publishers` WHERE (country LIKE '%England')
SELECT `publishers`.* FROM `publishers`