bookstore_app/app/controllers/users_controller.rb

	def create
		@user =User.new(users_params)
			if @user.save
---
INSERT INTO `users` (`userid`, `email`, `password_digest`, `created_at`, `updated_at`) VALUES ('fred1', 'fred@gmail.com', '$2a$10$KVeLU7.DZDHitUwYDsE8s.YMHKHhFlwn3yHus/3mINn9wZIy0Uve2', '2019-02-11 10:47:49', '2019-02-11 10:47:49')